
# *Database Programming with Python and SQLite*  --------Sadvi Sandhya

<a name="demo"></a>
## Using SQLite

### Advantages of SQLite

- does not run on a separate server
- creates portable SQL databases saved in a single file
- databases are stored in a very efficient manner and allow fast querying
- ideal for small databases or databases that need to be copied across machines.
- prototyping applications (e.g. as an embedded database server in a Python program).

### The `sqlite3` Command Line Utility

- useful for basic SQL tasks and databse maintenance
- for creating and dropping databases, it may be safer to use the command line than to roll the code into a Python program

In [1]:
#use The sqlite3 package
import sqlite3
sqlite_db = 'test_db.sqlite'
conn = sqlite3.connect(sqlite_db) 
c = conn.cursor()

Commands can be executed by passing them as string arguments to the `execute` method of the cursor we just created for this database.

*Nb. If this script has never been run before, the following will raise an (inconsequential) error message:*

In [2]:
c.execute('DROP TABLE houses;')

# Save (commit) the changes:
conn.commit()

In [3]:
c.execute('CREATE TABLE houses (field1 INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);')
conn.commit()

.

#### Adding data

In [4]:
# A
last_sale = (None, 4000, 5, 22, 619000)
# Execute Command
#c.execute('INSERT INTO houses VALUES (?,?,?,?,?,)',last_sale)
c.execute('INSERT INTO houses VALUES (?,?,?,?,?)',last_sale)

# Remember to commit the changes
conn.commit()

Notice that in this syntax we use the python `None` value, rather than `NULL`, to trigger SQLite to auto-increment the Primary Key. 

There is a related cursor method `executemany()` which takes an array of tuples and loops through them, substituting one tuple at a time.

> c.executemany(sql_command, values)

In [5]:
# A
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

# Nb. The "?" parameters are placeholders for data that will map to the table columns during insertion;
# this is a security measure against SQL injection attacks:
# 
c.executemany('INSERT INTO houses VALUES(?,?,?,?,?)',recent_sales)
conn.commit()

Select all rows from houses

In [6]:
# A
c.execute('SELECT * FROM houses').fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 2390, 4, 34, 319000),
 (3, 1870, 3, 14, 289000),
 (4, 1505, 3, 90, 269000)]




#### Adding data from a csv file

In [7]:
from numpy import genfromtxt

# import into nparray of ints, then convert to list of lists:
data = genfromtxt('C:\SS\IOD\JOBOUTCIOMEFOLDER\Lab Data\housing-data.csv', dtype = 'i8', 
                    delimiter = ',', skip_header = 1).tolist()

In [8]:
data

[[2104, 3, 70, 399900],
 [1600, 3, 28, 329900],
 [2400, 3, 44, 369000],
 [1416, 2, 49, 232000],
 [3000, 4, 75, 539900],
 [1985, 4, 61, 299900],
 [1534, 3, 12, 314900],
 [1427, 3, 57, 198999],
 [1380, 3, 14, 212000],
 [1494, 3, 15, 242500],
 [1940, 4, 7, 239999],
 [2000, 3, 27, 347000],
 [1890, 3, 45, 329999],
 [4478, 5, 49, 699900],
 [1268, 3, 58, 259900],
 [2300, 4, 77, 449900],
 [1320, 2, 62, 299900],
 [1236, 3, 78, 199900],
 [2609, 4, 5, 499998],
 [3031, 4, 21, 599000],
 [1767, 3, 44, 252900],
 [1888, 2, 79, 255000],
 [1604, 3, 13, 242900],
 [1962, 4, 53, 259900],
 [3890, 3, 36, 573900],
 [1100, 3, 60, 249900],
 [1458, 3, 29, 464500],
 [2526, 3, 13, 469000],
 [2200, 3, 28, 475000],
 [2637, 3, 25, 299900],
 [1839, 2, 40, 349900],
 [1000, 1, 5, 169900],
 [2040, 4, 75, 314900],
 [3137, 3, 67, 579900],
 [1811, 4, 24, 285900],
 [1437, 3, 50, 249900],
 [1239, 3, 22, 229900],
 [2132, 4, 28, 345000],
 [4215, 4, 66, 549000],
 [2162, 4, 43, 287000],
 [1664, 2, 40, 368500],
 [2238, 3, 37, 329900],
 [2567, 4, 57, 314000],
 [1200, 3, 76, 299000],
 [852, 2, 70, 179900],
 [1852, 4, 64, 299900],
 [1203, 3, 11, 239500]]

Suppose we need to put a placeholder in the first column for data that will be available later. Best practice is to insert the value `None`:

In [9]:
# prepend a None value to beginning of each sub-list:
for d in data:
    d.insert(0, None)

In [10]:
data

[[None, 2104, 3, 70, 399900],
 [None, 1600, 3, 28, 329900],
 [None, 2400, 3, 44, 369000],
 [None, 1416, 2, 49, 232000],
 [None, 3000, 4, 75, 539900],
 [None, 1985, 4, 61, 299900],
 [None, 1534, 3, 12, 314900],
 [None, 1427, 3, 57, 198999],
 [None, 1380, 3, 14, 212000],
 [None, 1494, 3, 15, 242500],
 [None, 1940, 4, 7, 239999],
 [None, 2000, 3, 27, 347000],
 [None, 1890, 3, 45, 329999],
 [None, 4478, 5, 49, 699900],
 [None, 1268, 3, 58, 259900],
 [None, 2300, 4, 77, 449900],
 [None, 1320, 2, 62, 299900],
 [None, 1236, 3, 78, 199900],
 [None, 2609, 4, 5, 499998],
 [None, 3031, 4, 21, 599000],
 [None, 1767, 3, 44, 252900],
 [None, 1888, 2, 79, 255000],
 [None, 1604, 3, 13, 242900],
 [None, 1962, 4, 53, 259900],
 [None, 3890, 3, 36, 573900],
 [None, 1100, 3, 60, 249900],
 [None, 1458, 3, 29, 464500],
 [None, 2526, 3, 13, 469000],
 [None, 2200, 3, 28, 475000],
 [None, 2637, 3, 25, 299900],
 [None, 1839, 2, 40, 349900],
 [None, 1000, 1, 5, 169900],
 [None, 2040, 4, 75, 314900],
 [None, 3137, 3, 67, 579900],
 [None, 1811, 4, 24, 285900],
 [None, 1437, 3, 50, 249900],
 [None, 1239, 3, 22, 229900],
 [None, 2132, 4, 28, 345000],
 [None, 4215, 4, 66, 549000],
 [None, 2162, 4, 43, 287000],
 [None, 1664, 2, 40, 368500],
 [None, 2238, 3, 37, 329900],
 [None, 2567, 4, 57, 314000],
 [None, 1200, 3, 76, 299000],
 [None, 852, 2, 70, 179900],
 [None, 1852, 4, 64, 299900],
 [None, 1203, 3, 11, 239500]]

*Nb. This is why we converted the input array to a list. An array can only hold one type of data (integers in this case) so we could not have inserted `None` before we did this conversion.*

In [11]:
# check:
print(type(data))
print(data[0:3])

<class 'list'>
[[None, 2104, 3, 70, 399900], [None, 1600, 3, 28, 329900], [None, 2400, 3, 44, 369000]]

Now we can insert each list item as a row of fields in the database.

In [12]:
# loop through data, running an INSERT on each record (i.e. sublist):
for d in data:
    c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d)

conn.commit()

In this case, because we were inserting the same value for all records, so we could have simply used a 'None' in the numpy `insert` method at column 0.

In [13]:
import numpy as np
d1 = np.asarray([1200, 3, 15, 250000])
d1 = d1.tolist()
d1.insert(0, None)
d1
c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d1)
conn.commit()

#### Deleting Rows

In [14]:
c.execute('DELETE FROM houses WHERE field1 IN (52,53)')
conn.commit()

QUIZ: What would `DELETE FROM houses` do?

In [15]:
c.execute('SELECT * FROM houses').fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 2390, 4, 34, 319000),
 (3, 1870, 3, 14, 289000),
 (4, 1505, 3, 90, 269000),
 (5, 2104, 3, 70, 399900),
 (6, 1600, 3, 28, 329900),
 (7, 2400, 3, 44, 369000),
 (8, 1416, 2, 49, 232000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (11, 1534, 3, 12, 314900),
 (12, 1427, 3, 57, 198999),
 (13, 1380, 3, 14, 212000),
 (14, 1494, 3, 15, 242500),
 (15, 1940, 4, 7, 239999),
 (16, 2000, 3, 27, 347000),
 (17, 1890, 3, 45, 329999),
 (18, 4478, 5, 49, 699900),
 (19, 1268, 3, 58, 259900),
 (20, 2300, 4, 77, 449900),
 (21, 1320, 2, 62, 299900),
 (22, 1236, 3, 78, 199900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (25, 1767, 3, 44, 252900),
 (26, 1888, 2, 79, 255000),
 (27, 1604, 3, 13, 242900),
 (28, 1962, 4, 53, 259900),
 (29, 3890, 3, 36, 573900),
 (30, 1100, 3, 60, 249900),
 (31, 1458, 3, 29, 464500),
 (32, 2526, 3, 13, 469000),
 (33, 2200, 3, 28, 475000),
 (34, 2637, 3, 25, 299900),
 (35, 1839, 2, 40, 349900),
 (36, 1000, 1, 5, 169900),
 (37, 2040, 4, 75, 314900),
 (38, 3137, 3, 67, 579900),
 (39, 1811, 4, 24, 285900),
 (40, 1437, 3, 50, 249900),
 (41, 1239, 3, 22, 229900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (45, 1664, 2, 40, 368500),
 (46, 2238, 3, 37, 329900),
 (47, 2567, 4, 57, 314000),
 (48, 1200, 3, 76, 299000),
 (49, 852, 2, 70, 179900),
 (50, 1852, 4, 64, 299900),
 (51, 1203, 3, 11, 239500)]

#### Filtering Rows

**1. Select Rows Where Bedrooms = 4**

In [16]:
# ANSWER
c.execute('SELECT * FROM houses WHERE bdrms = 4 ').fetchall()

[(2, 2390, 4, 34, 319000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (15, 1940, 4, 7, 239999),
 (20, 2300, 4, 77, 449900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (28, 1962, 4, 53, 259900),
 (37, 2040, 4, 75, 314900),
 (39, 1811, 4, 24, 285900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (47, 2567, 4, 57, 314000),
 (50, 1852, 4, 64, 299900)]

**2. Run a query to calculate the average floor area and price of each size of house (i.e. by number of bedrooms):**

In [17]:
# ANSWER
#field1 INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER
results = c.execute('SELECT sqft,price, AVG(sqft) AS avg_sqft, AVG(price) AS avg_price FROM houses GROUP BY bdrms')

results.fetchall()

[(1000, 169900, 1000.0, 169900.0),
 (1416, 232000, 1496.5, 280866.6666666667),
 (1870, 289000, 1827.5555555555557, 322892.51851851854),
 (2390, 319000, 2399.733333333333, 373553.13333333336),
 (4000, 619000, 4239.0, 659450.0)]

### Pandas connector

While databases provide many analytical capabilities, at some point we may need to pull data into Python for more flexible processing. Large, fixed operations would be more efficient in a database, but Pandas allows for interactive processing.

For example, if you want to aggregate nightly log-ins or sales for a report or dashboard, this would be a fixed operation on a large dataset. These computations would run more efficiently in the database system itself.

However, if we wanted to model the patterns of login behaviour or factors driving sales, then we would import the data to Python where we could use its simple interfaces to powerful analytic libraries.

In [18]:
import pandas as pd
from pandas.io import sql

Pandas can connect to most relational databases. In this demonstration, we will create and connect to a SQLite database.

### Writing data into a database

In [19]:
# Nb. Use low_memory=False to ensure that type inference does not fail due to buffered processing of input:
data = pd.read_csv('C:\SS\IOD\JOBOUTCIOMEFOLDER\Lab Data\housing-data.csv', low_memory = False)
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

We can move data in the opposite direction -- from a DataFrame to a database -- using the `to_sql` command, similar to the `to_csv` command.

`to_sql` takes as arguments:
    - `name`, the table name to create
    - `con`, a connection to a database
    - `index`, whether to input the index column
    - `schema`, if we want to write a custom schema for the new table
    - `if_exists`, what to do if the table already exists. We can overwrite it, add to it, or fail

This copies our `data` DataFrame to a sqlite3 table called `houses_pandas`:

In [20]:
data.to_sql('houses_pandas', con=conn, if_exists = 'replace', index= False)
#data.to_sql('houses_pandas', con = conn, if_exists = 'replace', index = False)

Run a query to get the average price of each house size from this table:

In [21]:
#ANSWER
#c.execute('SELECT bdrms, AVG(price) FROM houses_pandas GROUP BY bdrms').fetchall()
results1= c.execute('SELECT bdrms,sqft, ROUND(AVG(price),2) AS avg_price FROM houses_pandas GROUP BY bdrms')
results1.fetchall()

[(1, 1000, 169900.0),
 (2, 1416, 280866.67),
 (3, 2104, 326403.92),
 (4, 3000, 377449.79),
 (5, 4478, 699900.0)]

## Discussion

**Scenarios for using Pandas with SQLite**

1. When would you want to use Pandas on a dataset before storing it in a database?

2. When would you want to use Pandas on a dataset retrieved from a database?

<a name="guided-practice"></a>


# Reference: SQL Syntax 


#### SELECT Statement
Every query should start with `SELECT`.  `SELECT` is followed by the names of the columns in the output.

`SELECT` is always paired with `FROM`, and `FROM` identifies the table to retrieve data from.

```sql
SELECT
<columns>
FROM
<table>
```

`SELECT *` denotes returns *all* of the columns.

Housing Data example:
```sql
SELECT
sqft, bdrms
FROM houses_pandas;
```

**Check:** Write a query that returns the `sqft`, `bdrms` and `price`.

```sql
SELECT
sqft, bdrms, price
FROM houses_pandas;
```

#### WHERE Clause
`WHERE` is used to filter table to a specific criteria and follows the `FROM` clause.

```sql
SELECT
<columns>
FROM
<table>
WHERE
<condition>
```
Example:
```sql
SELECT
sqft, bdrms, age, price
FROM houses_pandas
WHERE bdrms = 2 and price < 250000;
```

The condition is effectively a row filter; rows that match the condition will be included in the rowset that is returned by the query.

**Check:** Write a query that returns the `sqft`, `bdrms`, `age` for houses older than 60 years.
>```sql
SELECT
sqft, bdrms, age
FROM houses_pandas
WHERE age > 60;
```

### AGGREGATIONS

Aggregations (or aggregate functions) are functions where the values of multiple rows are grouped together as input on certain criteria to form a single value of more significant meaning or measurement such as a set, a bag or a list.

Examples of aggregate funtions:

- Average (i.e., arithmetic mean)
- Count
- Maximum
- Minimum
- Median
- Mode
- Sum

In SQL they are performed in a `SELECT` statement as follows.

```sql
SELECT COUNT(price)
FROM houses_pandas;
```

```sql
SELECT AVG(sqft), MIN(price), MAX(price)
FROM houses_pandas
WHERE bdrms = 2;
```

### Read Order Data
- P12-ListOfOrders
- P12-OrderBreakdown

#### 1. Read CSV into DataFrame

In [22]:
import pandas as pd
import sqlite3
from pandas.io import sql

In [23]:
# Reading CSV to Dataframe
orders = pd.read_csv('C:\SS\IOD\JOBOUTCIOMEFOLDER\Lab Data\P12-ListOfOrders.csv', encoding = 'utf-8')
orders_break_down =  pd.read_csv('C:\SS\IOD\JOBOUTCIOMEFOLDER\Lab Data\P12-OrderBreakdown.csv', encoding = 'utf-8')

In [24]:
orders.head()

          Order ID  Order Date      Customer Name         Country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France

In [25]:
orders_break_down.head()

,Order ID,Product Name,Discount,Sales,Quantity,Category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45.0,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.0,3,Office Supplies
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27.0,2,Office Supplies
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17.0,2,Office Supplies

#### 2. Replace Space with Underscore in Column Names

In [26]:
orders.columns

Index(['Order ID', 'Order Date', 'Customer Name', 'Country'], dtype='object')

In [27]:
orders.columns.str.lower()

Index(['order id', 'order date', 'customer name', 'country'], dtype='object')

In [28]:
# ANSWER
orders.columns = [o.replace(' ', '_') for o in orders.columns.str.lower()]

In [29]:
# ANSWER
orders_break_down.columns = [o.replace(' ', '_') for o in orders_break_down.columns.str.lower()]

#### 3. Check DataTypes

In [30]:
# ANSWER
orders.dtypes

order_id         object
order_date       object
customer_name    object
country          object
dtype: object

In [31]:
# ANSWER
orders_break_down.dtypes

order_id         object
product_name     object
discount        float64
sales           float64
quantity          int64
category         object
dtype: object

#### 4. Save these two dataframes as a table in sqlite

In [32]:
# Establishing Local DB connection
db_connection = sqlite3.connect('eshop.db.sqlite')

# Save these two dataframes as a table in sqlite
orders.to_sql(name= 'orders', con =db_connection, if_exists='replace', index = False)
orders_break_down.to_sql(name= 'orders_break_down', con = db_connection, if_exists = 'replace', index= False)

#### 5. Select Number of Orders for Each Customer

We can use the `sql` function in `pandas.io` to run SQL queries to the database with the `.read_sql()` method. Here's an example:

In [33]:
# Select first 10 rows of all columns in orders table

query = """
        SELECT * 
        FROM orders
        LIMIT 10;
        """

orders_head_10 = sql.read_sql(query, con=db_connection)
orders_head_10

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France
5  ES-2011-5433855  2011-01-07       Dave Poirier          France
6  IT-2011-4546695  2011-01-08      Darren Powers          France
7  ES-2011-1138719  2011-01-11       Eric Murdock           Italy
8  ES-2011-1466305  2011-01-11         Mick Brown         Austria
9  ES-2011-4359424  2011-01-11  Dorothy Dickinson           Spain

In [34]:
query1 = """
        SELECT * 
        FROM orders_break_down
        LIMIT 10;
        """

orders_bd_head_10 = sql.read_sql(query1, con=db_connection)
orders_bd_head_10

,order_id,product_name,discount,sales,quantity,category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45.0,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.0,3,Office Supplies
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27.0,2,Office Supplies
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17.0,2,Office Supplies
5,ES-2011-3848439,"Binney & Smith Pencil Sharpener, Water Color",0.0,90.0,3,Office Supplies
6,ES-2011-3848439,"Sanford Canvas, Fluorescent",0.0,207.0,4,Office Supplies
7,ES-2011-5433855,"Bush Floating Shelf Set, Pine",0.1,155.0,1,Furniture
8,ES-2011-5433855,"Accos Thumb Tacks, Assorted Sizes",0.0,33.0,3,Office Supplies
9,ES-2011-5433855,"Smead Lockers, Industrial",0.1,716.0,4,Office Supplies

In [35]:
# Select Number of Orders for Each Customer
query = """
        SELECT customer_name,
        
        COUNT(DISTINCT orders.order_id) AS count 
        
        FROM orders
        
        JOIN orders_break_down ON orders_break_down.order_id = orders.order_id
        
        GROUP BY customer_name ORDER BY count DESC
        
        """
orders_num = sql.read_sql(query, con=db_connection)
orders_num

         customer_name  count
0           John Grady     13
1         Joel Jenkins     12
2       Aaron Smayling     12
3       Yoseph Carroll     11
4          Sarah Brown     11
..                 ...    ...
787  Brooke Gillingham      1
788     Barbara Fisher      1
789       Art Ferguson      1
790        Andy Reiter      1
791            Amy Cox      1

[792 rows x 2 columns]

In [36]:
# Select number of orders for each country
query = '''
        SELECT 
        country, 
        COUNT(DISTINCT orders_break_down.order_id) As Num_customer
        FROM orders_break_down
        JOIN orders ON orders.order_id = orders_break_down.order_id
        GROUP BY country
        
        '''

cust_country  = sql.read_sql(query, con= db_connection)
cust_country

           country  Num_customer
0          Austria           135
1          Belgium            68
2          Denmark            29
3          Finland            34
4           France           991
5          Germany           806
6          Ireland            50
7            Italy           493
8      Netherlands           194
9           Norway            37
10        Portugal            37
11           Spain           403
12          Sweden           100
13     Switzerland            40
14  United Kingdom           700

#### 6. Select Number of Customers for Each Country

In [37]:
#
# Select Number of Customers for Each Country
query_1 = '''
        SELECT 
        country, 
        COUNT(DISTINCT customer_name) As Num_customer
        FROM orders
        GROUP BY country
        ORDER BY Num_customer DESC
        
        '''

cust_country  = sql.read_sql(query_1, con= db_connection)
cust_country
        
#     sql_string = '''
#     SELECT 
#         country, 
#         COUNT(DISTINCT customer_name) AS Count 
#     FROM orders 
#     GROUP BY country 
#     ORDER BY Count DESC
# '''

           country  Num_customer
0           France           568
1          Germany           505
2   United Kingdom           473
3            Italy           351
4            Spain           306
5      Netherlands           172
6          Austria           125
7           Sweden            96
8          Belgium            66
9          Ireland            48
10     Switzerland            39
11          Norway            37
12        Portugal            36
13         Finland            33
14         Denmark            28

#### 7.A Select discount, sales, quantity for Each Order from orders_break_down Table

In [38]:
# Select discount, sales, quantity for Each Order from orders_break_down Table

sql_string = '''
    SELECT 
        discount
        , sales
        , quantity 
    FROM orders_break_down
'''

customers = sql.read_sql(sql_string, con = db_connection)
customers.head()

   discount  sales  quantity
0       0.5   45.0         3
1       0.0  854.0         7
2       0.0  140.0         3
3       0.5   27.0         2
4       0.5   17.0         2

#### 7.B Select discount, sales, quantity, total price for Each Order from orders_break_down Table

> Total Price = sales * quantity - discount

In [39]:
# Select discount, sales, quantity, total price for Each Order from orders_break_down Table

q1 = '''
        SELECT discount, sales,
        quantity, (sales*quantity-discount) AS tot_price
        FROM orders_break_down
        ORDER BY tot_price DESC
    '''

tot_pr = sql.read_sql(q1, con= db_connection)
tot_pr

      discount   sales  quantity  tot_price
0          0.1  5729.0        14    80205.9
1          0.0  6517.0        12    78204.0
2          0.1  4748.0        14    66471.9
3          0.1  5726.0        10    57259.9
4          0.0  4141.0        13    53833.0
...        ...     ...       ...        ...
8042       0.5     5.0         1        4.5
8043       0.0     4.0         1        4.0
8044       0.5     4.0         1        3.5
8045       0.5     4.0         1        3.5
8046       0.5     3.0         1        2.5

[8047 rows x 4 columns]

#### 7.C Select All Orders from orders_break_down Table Where Total Price Greater Than 100

In [40]:
# Select All Orders from orders_break_down Table Where Total Price Greater Than 100

q2= '''
        SELECT * ,
        (sales*quantity-discount) AS tot_price
        FROM orders_break_down
        WHERE tot_price > 100
        ORDER BY tot_price DESC
        
    '''
tot_pr_100 = sql.read_sql(q2, con=db_connection)
tot_pr_100

,order_id,product_name,discount,sales,quantity,category,tot_price
0,ES-2014-3785216,"Hon Executive Leather Armchair, Adjustable",0.1,5729.0,14,Furniture,80205.9
1,ES-2011-3248922,"Hamilton Beach Stove, Silver",0.0,6517.0,12,Office Supplies,78204.0
2,ES-2012-2183106,"Canon Wireless Fax, High-Speed",0.1,4748.0,14,Technology,66471.9
3,IT-2013-4602742,"Samsung Smart Phone, VoIP",0.1,5726.0,10,Technology,57259.9
4,ES-2014-2637201,"Brother Fax Machine, Laser",0.0,4141.0,13,Technology,53833.0
...,...,...,...,...,...,...,...
6461,ES-2012-1763830,"Elite Scissors, High Speed",0.5,34.0,3,Office Supplies,101.5
6462,IT-2012-4099397,"Sanford Canvas, Blue",0.5,51.0,2,Office Supplies,101.5
6463,ES-2013-4250046,"Cardinal Binding Machine, Durable",0.5,51.0,2,Office Supplies,101.5
6464,ES-2014-5784412,"Okidata Calculator, White",0.5,51.0,2,Technology,101.5
6465,IT-2014-5393609,"Tenex Lockers, Single Width",0.5,102.0,1,Office Supplies,101.5

#### 8. Select All Customer And The Product They Have Bought

In [133]:
# Select All Customer And The Product They Have Bought
q3= '''
        SELECT customer_name, product_name 
        FROM orders
        JOIN orders_break_down on orders_break_down.order_id = orders.order_id
        ORDER BY customer_name
    '''
cust_prod= sql.read_sql(q3, con=db_connection)
cust_prod

           customer_name                                       product_name
0          Aaron Bergman                   Apple Office Telephone, Cordless
1          Aaron Bergman                       Elite Box Cutter, High Speed
2          Aaron Bergman  Harbour Creations Round Labels, Laser Printer ...
3          Aaron Bergman                Binney & Smith Markers, Fluorescent
4          Aaron Bergman              Novimex Shipping Labels, Alphabetical
...                  ...                                                ...
8042  Zuschuss Donatelli                         Hewlett Fax Machine, Laser
8043  Zuschuss Donatelli  Office Star Executive Leather Armchair, Adjust...
8044  Zuschuss Donatelli                          Accos Rubber Bands, Metal
8045  Zuschuss Donatelli                  Memorex Numeric Keypad, Bluetooth
8046  Zuschuss Donatelli                   SanDisk Parchment Paper, Premium

[8047 rows x 2 columns]

#### 9.A Select Number of 'Furniture' Orders For Each Country

In [53]:
# Select Number of 'Furniture' Orders For Each Country
q4= '''
    SELECT * ,
    COUNT(category) as count_furn
    FROM orders 
    JOIN orders_break_down ON orders_break_down.order_id = orders.order_id
    WHERE category = 'Furniture'
    GROUP BY country
    ORDER BY count_furn desc

'''
furnt_count = sql.read_sql(q4, con=db_connection)
furnt_count

,order_id,order_date,customer_name,country,order_id,product_name,discount,sales,quantity,category,count_furn
0,ES-2011-5433855,2011-01-07,Dave Poirier,France,ES-2011-5433855,"Bush Floating Shelf Set, Pine",0.1,155.0,1,Furniture,299
1,ES-2011-1460199,2011-01-12,Roy Phan,Germany,ES-2011-1460199,"Ikea Stackable Bookrack, Traditional",0.1,552.0,5,Furniture,264
2,ES-2011-4869686,2011-01-03,Dorothy Dickinson,United Kingdom,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture,180
3,ES-2011-5497239,2011-01-22,Paul Stevenson,Italy,ES-2011-5497239,"Bush Classic Bookcase, Traditional",0.0,825.0,2,Furniture,136
4,ES-2011-4359424,2011-01-11,Dorothy Dickinson,Spain,ES-2011-4359424,"Bevis Training Table, with Bottom Storage",0.6,268.0,2,Furniture,123
5,ES-2011-5389664,2011-02-09,Nat Gilpin,Netherlands,ES-2011-5389664,"Advantus Frame, Duo Pack",0.2,267.0,3,Furniture,76
6,ES-2011-4932761,2011-05-18,Sean O'Donnell,Austria,ES-2011-4932761,"Office Star Swivel Stool, Adjustable",0.0,1059.0,6,Furniture,40
7,IT-2011-5233011,2011-03-31,Todd Sumrall,Sweden,IT-2011-5233011,"Advantus Photo Frame, Durable",0.6,40.0,2,Furniture,36
8,ES-2011-2377967,2011-02-24,Julie Creighton,Belgium,ES-2011-2377967,"Bush Classic Bookcase, Mobile",0.0,2076.0,5,Furniture,20
9,ES-2011-3081212,2011-08-27,Victoria Wilson,Finland,ES-2011-3081212,"Novimex Rocking Chair, Set of Two",0.0,267.0,2,Furniture,16
10,ES-2011-3108517,2011-06-01,Matt Hagelstein,Ireland,ES-2011-3108517,"Ikea Classic Bookcase, Traditional",0.5,1029.0,5,Furniture,12
11,ES-2011-3818297,2011-02-10,Jennifer Patt,Switzerland,ES-2011-3818297,"Sauder Library with Doors, Mobile",0.0,780.0,2,Furniture,11
12,IT-2011-5643162,2011-05-09,Kristen Hastings,Portugal,IT-2011-5643162,"Eldon Frame, Durable",0.5,170.0,3,Furniture,10
13,ES-2011-1586186,2011-06-16,Vivek Grady,Denmark,ES-2011-1586186,"Office Star Bag Chairs, Set of Two",0.5,87.0,3,Furniture,9
14,ES-2011-1637634,2011-03-21,Ed Jacobs,Norway,ES-2011-1637634,"Rubbermaid Door Stop, Duo Pack",0.0,132.0,3,Furniture,6

#### 9.B Select Number of 'Furniture' Orders For The Country Denmark

In [60]:
# Select Number of 'Furniture' Orders For The Country Denmark
q5= '''
        SELECT country,
        COUNT(orders_break_down.category) AS count_furn
        FROM orders
        JOIN orders_break_down ON orders_break_down.order_id = orders.order_id
        WHERE orders_break_down.category = 'Furniture' AND orders.country = 'Denmark'

'''
furn_count_d = sql.read_sql(q5, con=db_connection)
furn_count_d

   country  count_furn
0  Denmark           9

#### 10. Select Total Sales With Discount and Without Discount for Each Country

In [66]:
# Select Total Sales With Discount and Without Discount for Each Country
#order_id	order_date	customer_name	country
# order_id	product_name	discount	sales	quantity	category
q6='''

    SELECT country,
    SUM(CASE WHEN discount == 0 THEN sales ELSE 0 END) AS discounted_sales,
    SUM(CASE WHEN discount >0 THEN sales ELSE 0 END) AS Non_discounted_sales
    FROM orders
    JOIN orders_break_down ON orders_break_down.order_id = orders.order_id
    GROUP BY country  
    
    
'''
sales= sql.read_sql(q6, con = db_connection)
sales

           country  discounted_sales  Non_discounted_sales
0          Austria           79382.0                   0.0
1          Belgium           42320.0                   0.0
2          Denmark               0.0                7763.0
3          Finland           20702.0                   0.0
4           France          129791.0              479892.0
5          Germany          245424.0              243257.0
6          Ireland               0.0               15998.0
7            Italy          174097.0               78645.0
8      Netherlands               0.0               70313.0
9           Norway           20529.0                   0.0
10        Portugal               0.0               15106.0
11           Spain          164895.0               84507.0
12          Sweden               0.0               30490.0
13     Switzerland           24874.0                   0.0
14  United Kingdom          330854.0               89643.0

#### 11.A Select Total Quantity, Total Sales for Each Country

In [68]:
# Select Total Quantity, Total Sales for Each Country
#order_id	order_date	customer_name	country
# order_id	product_name	discount	sales	quantity	category

q7= '''
   SELECT
   orders.country,
   SUM(quantity) As qty_sum,
   SUM(sales) As sales_sum 
   FROM orders 
   JOIN orders_break_down ON orders_break_down.order_id = orders.order_id
   GROUP BY orders.country

'''
sales1= sql.read_sql(q7, con = db_connection)
sales1

           country  qty_sum  sales_sum
0          Austria      973    79382.0
1          Belgium      532    42320.0
2          Denmark      204     7763.0
3          Finland      201    20702.0
4           France     7329   609683.0
5          Germany     6179   488681.0
6          Ireland      392    15998.0
7            Italy     3612   252742.0
8      Netherlands     1526    70313.0
9           Norway      261    20529.0
10        Portugal      286    15106.0
11           Spain     2881   249402.0
12          Sweden      753    30490.0
13     Switzerland      308    24874.0
14  United Kingdom     4917   420497.0

#### 11.B Select Top 3 Country Based on Sales

In [69]:
# Select Top 3 Country Based on Sales

q8='''
    SELECT orders.country,
    SUM(sales) As tot_sales
    FROM orders
    JOIN orders_break_down ON orders_break_down.order_id = orders.order_id
    GROUP BY country
    ORDER BY tot_sales DESC LIMIT 3

'''
top_3 = sql.read_sql(q8, con=db_connection)
top_3

          country  tot_sales
0          France   609683.0
1         Germany   488681.0
2  United Kingdom   420497.0

#### 11.C Select Bottom 3 Country Based On Quantities

In [72]:
# Select Bottom 3 Country Based On Quantities
q9='''
    SELECT orders.country,
    SUM(quantity) As tot_qty
    FROM orders
    JOIN orders_break_down ON orders_break_down.order_id = orders.order_id
    GROUP By country
    ORDER BY tot_qty ASC LIMIT 3

'''
tot_qty_3 = sql.read_sql(q9, con= db_connection)
tot_qty_3

   country  tot_qty
0  Finland      201
1  Denmark      204
2   Norway      261

#### 12. Select Average Sales By Categroy For The Country 'France'

In [82]:
# Select Average Sales By Categroy For The Country 'France'
#order_id	order_date	customer_name	country
# order_id	product_name	discount	sales	quantity	category
q10 = '''
        SELECT country,category,
        AVG(sales) avg_sales
        FROM orders_break_down
        JOIN orders ON orders.order_id = orders_break_down.order_id
        WHERE orders.country = 'France'
        GROUP BY category
        ORDER BY avg_sales DESC

'''
avg_sales= sql.read_sql(q10, con= db_connection)
avg_sales

  country         category   avg_sales
0  France       Technology  595.145078
1  France        Furniture  582.314381
2  France  Office Supplies  167.217709

#### 13. Select Country, Category and Total Sales Where Average Total Sales is The Highest

In [87]:
# Select Country, Category and Total Sales Where Average Total Sales is The Highest
q11= '''
        SELECT orders.country, orders_break_down.category,
        AVG(orders_break_down.sales) AS avg_tot_sale
        FROM orders
        JOIN orders_break_down ON orders_break_down.order_id = orders.order_id
        GROUP BY orders.country, orders_break_down.category
        ORDER BY avg_tot_sale DESC LIMIT 1

'''
avgtot_sales= sql.read_sql(q11, con= db_connection)
avgtot_sales

       country    category  avg_tot_sale
0  Switzerland  Technology    902.846154

### JOINS

In [90]:
# merge the tables orders and orders_break_down
order_mega = pd.merge(orders, orders_break_down, how= 'left', on = 'order_id')
order_mega

,order_id,order_date,customer_name,country,product_name,discount,sales,quantity,category
0,IT-2011-3647632,2011-01-01,Eugene Moren,Sweden,"Enermax Note Cards, Premium",0.5,45.0,3,Office Supplies
1,ES-2011-4869686,2011-01-03,Dorothy Dickinson,United Kingdom,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture
2,ES-2011-4939443,2011-01-04,Arthur Prichep,France,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.0,3,Office Supplies
3,IT-2011-2942451,2011-01-04,Grant Thornton,United Kingdom,"Boston Markers, Easy-Erase",0.5,27.0,2,Office Supplies
4,IT-2011-2942451,2011-01-04,Grant Thornton,United Kingdom,"Eldon Folders, Single Width",0.5,17.0,2,Office Supplies
...,...,...,...,...,...,...,...,...,...
8042,ES-2014-3638865,2014-12-31,Susan Vittorini,United Kingdom,"Fellowes Shelving, Single Width",0.0,289.0,5,Office Supplies
8043,ES-2014-4785777,2014-12-31,Dennis Pardue,Germany,"Wilson Jones Index Tab, Economy",0.0,32.0,5,Office Supplies
8044,IT-2014-3715679,2014-12-31,Jim Kriz,Netherlands,"BIC Pencil Sharpener, Fluorescent",0.5,30.0,2,Office Supplies
8045,IT-2014-3715679,2014-12-31,Jim Kriz,Netherlands,"Avery Binder Covers, Recycled",0.5,23.0,4,Office Supplies
8046,IT-2014-3715679,2014-12-31,Jim Kriz,Netherlands,"StarTech Phone, Red",0.5,108.0,3,Technology